{
  "header": {
    "navigation": [
      "Accueil",
      "Projets",
      "Documentations",
      "À propos"
    ],
    "actions": [
      "Login",
      "Sign-Up"
    ]
  },
  "banner": {
    "title": "Yanis Kouidri",
    "shortDescription": "Ingénieur en informatique et réseaux.",
    "location": "Toulouse, France."
  },
  "mainSkills": [
    {
      "titre": "Informatique",
      "contenu": "Programmation, administration système, sécurité informatique, développement web, développement mobile, développement logiciel, cryptographie, mes compétences en informatique sont variées et me permettent de concevoir et créer des projets de A à Z dans ces nombreux domaines."
    },
    {
      "titre": "Réseau",
      "contenu": "Réseaux locaux (LAN), réseaux étendus (WAN), réseaux sans fil, réseaux mobiles, protocoles de routage, protocoles de transport (TCP), protocoles de niveau application (HTTP, DNS, SMTP), toutes ces compétences me permettent de comprendre comment un si grand ensemble de machines, différentes et communiquant de manière différente, peuvent communiquer entre elles à travers Internet."
    }
  ],
  "myHistory": {
    "title": "Mon parcours",
    "paragraphs": [
      "Je m'appelle Yanis Kouidri et j'ai 22 ans. Au collège puis au lycée, je commence à m'intéresser à l'informatique. J'apprends les bases de Linux en travaillant sur un serveur Minecraft que j'administre.",
      "Après avoir obtenu le baccalauréat, je m'oriente vers un DUT Réseaux et Télécommunications pour poursuivre mon apprentissage dans l'informatique. C'est à ce moment-là que j'apprends à programmer, à administrer un réseau, à créer des serveurs et à comprendre comment fonctionne Internet.",
      "À la fin de mon DUT, je poursuis mes études à l'ENSEEIHT, une grande école d'ingénieurs à Toulouse, dans la filière Sciences du Numérique. J'effectue mes 3 années à l'ENSEEIHT en alternance avec Thales Alenia Space.",
      "Actuellement en dernière année de mon parcours d'ingénieur, je suis en train d'effectuer un semestre d'échange à l'université de Tor Vergata à Rome. Ces 4 dernières années d'étude et d'apprentissage m'ont permis d'en apprendre plus sur ce que je veux et sur ce que je ne veux pas faire, c'est pourquoi je compte commencer une thèse sur la thématique des réseaux informatiques une fois mon diplôme obtenu."
    ]
  },
  "competences": {
    "titre": "Mes compétences",
    "programmations": [
      "C",
      "Java",
      "Python",
      "PHP",
      "OCaml",
      "Ada",
      "JavaScript"
    ],
    "systeme_et_web": [
      "React",
      "HTML",
      "CSS",
      "Git"
    ],
    "reseau": []
  },
  "contact": {
    "titre": "Contactez moi",
    "liens": [
      "Linkedin",
      "Github",
      "CV - Français",
      "CV - English",
      "E-mail",
      "PGP Key"
    ]
  },
  "footer": {
    "copyright": "© 2025 Yanis Kouidri",
    "note_technique": "Ce site a été entièrement réalisé par Yanis Kouidri en utilisant React et Vite.",
    "message": "Merci de m'avoir lu jusqu'ici, j'espère que le site vous plait !"
  }
}